Revit 2027 API
ParameterTypeId.SteelElemWeldLocation Property
 "Location"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldLocation { get; }
Public Shared ReadOnly Property SteelElemWeldLocation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldLocation {
	ForgeTypeId^ get ();
}
static member SteelElemWeldLocation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace